InformationRegisters/ФизическиеЛицаБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныОтправкиСотрудниковБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУдачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНеудачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныОтправкиСотрудниковБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПричиныОтправкиСотрудниковБронированияКомандировок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУсловию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Непосредственно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РегулярнаяОтправкаСотрудниковБазовый/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьИзмененияПодразделенийИЗарегистрироватьНеобходимостьОтправки(СистемаБронирования,
	Источник,
	ИспользуетсяОтборПоПодразделениям) Экспорт

	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();

	Если ИзменившиесяДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивСотрудниковДляДобавления = Новый Массив;
	МассивСотрудниковДляУдаления = Новый Массив;

	ПричинаПоУсловию = Перечисления.ПричиныОтправкиСотрудниковБронированияКомандировок.ПоУсловию;
	ПричинаНепосредственно = Перечисления.ПричиныОтправкиСотрудниковБронированияКомандировок.Непосредственно;

	Если ИспользуетсяОтборПоПодразделениям Тогда

		ТаблицаОтправляемыхПодразделений = РегулярнаяОтправкаСотрудников.ПодразделенияБронированияКомандировок(СистемаБронирования);
		ТаблицаОтправляемыхСотрудников = РегулярнаяОтправкаСотрудников.СотрудникиБронированияКомандировок(СистемаБронирования,
			Источник.ВыгрузитьКолонку("ФизическоеЛицо"), Неопределено, Неопределено);
			
		ЕстьПодразделенияДляОтправки = Ложь;
		Если ЗначениеЗаполнено(ТаблицаОтправляемыхПодразделений) Тогда
			ЕстьПодразделенияДляОтправки = Истина;
			ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаОтправляемыхПодразделений, "Подразделение");
		КонецЕсли;
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаОтправляемыхСотрудников, "ФизическоеЛицо");

		Для Каждого СтрокаИзменения Из ИзменившиесяДанные Цикл
			Если СтрокаИзменения.Добавление Тогда
				ФизическоеЛицо = СтрокаИзменения.НовоеЗначениеГоловнойСотрудник.ФизическоеЛицо;
				Если СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием
					И ЕстьПодразделенияДляОтправки Тогда

					НайденноеПодразделение = ТаблицаОтправляемыхПодразделений.Найти(
						СтрокаИзменения.НовоеЗначениеПодразделение, "Подразделение");

					Если НайденноеПодразделение <> Неопределено Тогда
						РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляДобавления, ФизическоеЛицо);
					КонецЕсли;

				ИначеЕсли СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда

					СотрудникВНастройках = ТаблицаОтправляемыхСотрудников.Найти(
						ФизическоеЛицо, "ФизическоеЛицо");

					Если СотрудникВНастройках <> Неопределено Тогда
						Если СотрудникВНастройках.Отправляется Тогда
							РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляУдаления, ФизическоеЛицо);
						КонецЕсли;
					КонецЕсли;

				ИначеЕсли СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Перемещение Тогда

					Если ЕстьПодразделенияДляОтправки Тогда
						НайденноеПодразделение = ТаблицаОтправляемыхПодразделений.Найти(
							СтрокаИзменения.НовоеЗначениеПодразделение, "Подразделение");
					Иначе
						НайденноеПодразделение = Неопределено;
					КонецЕсли;
					
					СотрудникВНастройках = ТаблицаОтправляемыхСотрудников.Найти(
						ФизическоеЛицо, "ФизическоеЛицо");

					Если НайденноеПодразделение = Неопределено И СотрудникВНастройках = Неопределено Тогда
						Продолжить;
					ИначеЕсли НайденноеПодразделение <> Неопределено И СотрудникВНастройках = Неопределено Тогда
						РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляДобавления, ФизическоеЛицо);
					ИначеЕсли НайденноеПодразделение = Неопределено И СотрудникВНастройках <> Неопределено Тогда
						Если СотрудникВНастройках.ПричинаОтправки = ПричинаНепосредственно Тогда
							Продолжить;
						Иначе
							Если СотрудникВНастройках.Отправляется Тогда
								РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляУдаления, ФизическоеЛицо);
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли НайденноеПодразделение <> Неопределено И СотрудникВНастройках <> Неопределено Тогда
						Если СотрудникВНастройках.ПричинаОтправки = ПричинаНепосредственно Тогда
							Продолжить;
						Иначе
							Если Не СотрудникВНастройках.Отправляется Тогда
								РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляДобавления, ФизическоеЛицо);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	Иначе

		Для Каждого СтрокаИзменения Из ИзменившиесяДанные Цикл
			Если СтрокаИзменения.Добавление Тогда
				ФизическоеЛицо = СтрокаИзменения.НовоеЗначениеГоловнойСотрудник.ФизическоеЛицо;
				Если СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
					РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляДобавления, ФизическоеЛицо);
				ИначеЕсли СтрокаИзменения.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
					РегулярнаяОтправкаСотрудников.ДобавитьЭлементВСписок(МассивСотрудниковДляУдаления, ФизическоеЛицо);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	Если МассивСотрудниковДляДобавления.Количество() > 0 Тогда
		РегистрыСведений.ФизическиеЛицаБронированияКомандировок.ЗарегистрироватьИзмененияСотрудниковВСпискеОтправляемых(
			СистемаБронирования, МассивСотрудниковДляДобавления, ПричинаПоУсловию, Истина);
	КонецЕсли;
	Если МассивСотрудниковДляУдаления.Количество() > 0 Тогда
		РегистрыСведений.ФизическиеЛицаБронированияКомандировок.УдалитьСотрудниковИзСпискаОтправляемых(
			СистемаБронирования, МассивСотрудниковДляУдаления);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьОтборПоДолжностиПоШтатномуРасписанию(Параметры, СписокПодразделений) Экспорт

КонецПроцедуры

#КонецОбласти
